In [1]:
import numpy as np
import pandas as pd

In [3]:
frame = pd.DataFrame(np.random.randn(4,3),columns=list('bde'),
                    index = ['Utah','Ohio','Texas','Oregon']
                                                      )
frame

               b         d         e
Utah    0.182525 -0.767240 -0.076739
Ohio   -2.806026 -0.131357 -0.222158
Texas   1.137438  0.144919 -0.262083
Oregon  0.162622  1.120878  1.358126

In [4]:
np.random.randn()

1.1981158928219082

In [5]:
np.random.randn()

-0.10558049911903443

In [6]:
np.random.randn()

1.5001580861434252

In [7]:
np.random.randn(5,3)

array([[-0.8778367 , -0.31678867,  0.09727667],
       [ 0.63773861, -2.94125792,  0.38011062],
       [-0.68895261,  0.15831708,  1.45208126],
       [ 1.31948401,  0.94504781,  1.04646519],
       [-0.62783751,  0.78343461, -0.29505378]])

In [8]:
3*np.random.randn(5,3)

array([[-0.02327862, -1.08918722, -4.23603515],
       [ 4.55413846, -0.09434885,  5.1138985 ],
       [-3.70919459,  1.77202336, -5.43939912],
       [ 1.97929491, -0.67660648,  1.44350238],
       [-0.1558973 , -0.69759461, -5.51441597]])

In [9]:
np.abs(frame)

               b         d         e
Utah    0.182525  0.767240  0.076739
Ohio    2.806026  0.131357  0.222158
Texas   1.137438  0.144919  0.262083
Oregon  0.162622  1.120878  1.358126

In [11]:
#lambda函数的操作
f=lambda x: x.max() - x.min()

In [12]:
frame.apply(f)  #计算每一列的最大最小值的差

b    3.943464
d    1.888118
e    1.620209
dtype: float64

In [13]:
#可以设置每行调用一次f函数
frame.apply(f,axis = 'columns')

Utah      0.949765
Ohio      2.674669
Texas     1.399521
Oregon    1.195504
dtype: float64

In [14]:
format = lambda x: '%.2f' %x

In [15]:
frame.applymap(format)

            b      d      e
Utah     0.18  -0.77  -0.08
Ohio    -2.81  -0.13  -0.22
Texas    1.14   0.14  -0.26
Oregon   0.16   1.12   1.36

In [16]:
frame['e'].map(format)

Utah      -0.08
Ohio      -0.22
Texas     -0.26
Oregon     1.36
Name: e, dtype: object

In [18]:
#排序和排名
obj = pd.Series(range(4),index = ['b','e','c','a'])
obj

b    0
e    1
c    2
a    3
dtype: int64

In [19]:
obj.sort_index()

a    3
b    0
c    2
e    1
dtype: int64

In [20]:
obj.sort_values

<bound method Series.sort_values of b    0
e    1
c    2
a    3
dtype: int64>

In [21]:
#dataframe中
obj1 = pd.DataFrame(np.arange(8).reshape(2,4),index = ['three','one'],
                   columns = ['d','a','b','c']
                   )
obj1

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [22]:
obj1.sort_index

<bound method DataFrame.sort_index of        d  a  b  c
three  0  1  2  3
one    4  5  6  7>

In [23]:
obj1.sort_index(axis = 'columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [24]:
obj1.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [25]:
obj1.sort_index(axis = 1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [26]:
frame = pd.DataFrame({'a':[4,7,-3,2],'b':[0,1,0,1]})
frame

   a  b
0  4  0
1  7  1
2 -3  0
3  2  1

In [27]:
frame.sort_values(by = 'b')

   a  b
0  4  0
2 -3  0
1  7  1
3  2  1

In [28]:
frame.sort_values(by = 'a')

   a  b
2 -3  0
3  2  1
0  4  0
1  7  1

In [29]:
help(sort_values)

NameError: name 'sort_values' is not defined

In [33]:
sort_values?

Object `sort_values` not found.

In [34]:
frame?

In [35]:
obj?

In [37]:
frame.sort_values(by = ['a','b'])

   a  b
2 -3  0
3  2  1
0  4  0
1  7  1

In [40]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12,13]],
                 columns = ['one','two','three','four'],
                  index = ['a','b','c','d']
                 )
df

   one  two  three  four
a    1    2      3   NaN
b    4    5      6   NaN
c    7    8      9   NaN
d   10   11     12  13.0

In [41]:
df.div(7)

        one       two     three      four
a  0.142857  0.285714  0.428571       NaN
b  0.571429  0.714286  0.857143       NaN
c  1.000000  1.142857  1.285714       NaN
d  1.428571  1.571429  1.714286  1.857143

In [42]:
df.div(7,axis = 1)
#axis是归约轴，0为行向，1为列向

        one       two     three      four
a  0.142857  0.285714  0.428571       NaN
b  0.571429  0.714286  0.857143       NaN
c  1.000000  1.142857  1.285714       NaN
d  1.428571  1.571429  1.714286  1.857143

In [44]:
df.div(7,axis=0)

        one       two     three      four
a  0.142857  0.285714  0.428571       NaN
b  0.571429  0.714286  0.857143       NaN
c  1.000000  1.142857  1.285714       NaN
d  1.428571  1.571429  1.714286  1.857143

In [45]:
df.div(7,axis ='columns')

        one       two     three      four
a  0.142857  0.285714  0.428571       NaN
b  0.571429  0.714286  0.857143       NaN
c  1.000000  1.142857  1.285714       NaN
d  1.428571  1.571429  1.714286  1.857143

In [49]:
df.mean(axis = 'columns',skipna=True)

a     2.0
b     5.0
c     8.0
d    11.5
dtype: float64

In [50]:
df.describe

<bound method NDFrame.describe of    one  two  three  four
a    1    2      3   NaN
b    4    5      6   NaN
c    7    8      9   NaN
d   10   11     12  13.0>

In [51]:
df.describe()

             one        two      three  four
count   4.000000   4.000000   4.000000   1.0
mean    5.500000   6.500000   7.500000  13.0
std     3.872983   3.872983   3.872983   NaN
min     1.000000   2.000000   3.000000  13.0
25%     3.250000   4.250000   5.250000  13.0
50%     5.500000   6.500000   7.500000  13.0
75%     7.750000   8.750000   9.750000  13.0
max    10.000000  11.000000  12.000000  13.0